class ClientFilter(object):
    def __init__(self):
        self.f_list = ["微资讯", "发布", "播报", "地震局", "新闻", "大事件", "大热门",
                       "官方", "微热点", "新京报", "爆料", "手机报", "日报", "卫视",
                       "广播", "检察", "消防", "共青团", "新浪", "速递", "速报", "公安", "防震", "地震台网",
                       "司法", "法院", "路网", "团委", "澎湃视频", "视频", "交警", "晚报", "记者", "新华社",
                       "四川在线", "同城", "微博", "网警", "大众网", "资讯", "政协报", "商报", "舆情", "人民网"
                       "联通", "交通", "反邪教", "政法", "减灾", "身边事", "频道", "校园", "晨报", "头条", "信息报",
                       "周刊", "电网报", "城事微金华", "华讯网", "青海网", "今日宜宾", "都市报", "传播", "青年报"
                ]

    def check(self, s):
        for word in self.f_list:
            #print("check word", word)
            if word in s:
                return False

        return True

    def add(self, s):
        self.f_list.append(s)

